In [57]:
import pandas as pd
import sqlite3

In [58]:
file_path = '/Users/claire/git/flatiron/phase_02/finalproject/DSC-Phase2-Project2/unzippedData/im.db'
conn = sqlite3.connect(file_path)

In [59]:
! ls ../unzippedData

bom.movie_gross.csv.gz  rt.movie_info.tsv.gz    tn.movie_budgets.csv.gz
im.db                   rt.reviews.tsv.gz
im.db.zip               tmdb.movies.csv.gz

In [60]:
cursor = conn.cursor()

![Image of ERD Diagram IMDB](https://raw.githubusercontent.com/learn-co-curriculum/dsc-phase-2-project-v3/main/movie_data_erd.jpeg)

In [61]:
# Create a dataframe from the master table of our sql database:
# Write the query:
imdb_query = """ 
    SELECT *
    FROM sqlite_master
"""
# Read the contents of the query into a Pandas dataframe:
imdb_df = pd.read_sql(imdb_query, conn)

# From the pandas dataframe, iterate through the column "name" (all our table names)
# Make a list of those table names:
table_list = [name for name in imdb_df['name']]

def table_to_df(my_table, my_conn):
    '''Input is name of database table as a string, output is dataframe'''
    my_query = f"""SELECT * FROM {my_table}"""
    df = pd.read_sql(my_query, my_conn)
    return df

# Make a dataframe where the keys are the names of the tables, 
# and the values are pandas dataframes made from those tables:
dict_tables = {name: pd.DataFrame(data=table_to_df(name,conn)) for name in table_list}

# Make dataframe names, prefixed by "df_" and then the original table name
# Output is 
for i in range(len(table_list)):
    # converts the STRING f"df_{table_list[i]}" to a VARIABLE equal to each df in df_tables
    exec(f"{table_list[i]}_df" + " = dict_tables[table_list[i]]") 
    

# Lez try out one of our brand-new dfs!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
writers_df.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0438973  nm0175726
2  tt0438973  nm1802864
3  tt0462036  nm1940585
4  tt0835418  nm0310087

In [62]:
"""
movie_basics_df
directors_df
known_for_df
movie_akas_df
movie_ratings_df
persons_df
principals_df
writers_df
"""
df_writers.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0438973  nm0175726
2  tt0438973  nm1802864
3  tt0462036  nm1940585
4  tt0835418  nm0310087

In [63]:
# Make function to clean up column names
    # Title
    # Change underscore to space
    # In place

In [64]:
# Make function to split up comma seperated values to become a set or list
    # will help easily do IN

In [65]:
# when we're looking at how much they spent vs made -- make a score based on budget to revenue
    # How much did they put in, versus how much they put out.


# Gross Total:
    # 

# profitability -- maybe set a lower boundary
    # gross - budget

# Blockbursters + Indie?

# When we reccommend an indie film we expect less profability, and less people rating it

# Ratings
    # ratings * number_of_people